// КЛИЕНТСКИЕ ПРОЦЕДУРЫ И ФУНКЦИИ //

&НаКлиенте
Процедура СуммаСписанияПриИзменении(Элемент)
	РассчитатьСуммуОприходования();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуОприходования ()
	Если ВалютаПриход <> ВалютаРасход Тогда
    Иначе 
		Объект.СуммаОприходования = Объект.СуммаСписания;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)
	ОбновитьВидимость();
КонецПроцедуры

// СЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ //

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РЕЗ = ОбщийМодульСервер.ПолучитьЗначенияПоУмолчанию(РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя(),"Отправитель,Получатель,СтатьяДДС");
		ЗаполнитьЗначенияСвойств(Объект,Рез);
	КонецЕсли;
	ОбновитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимость ()
	ОбновитьНадписиРасход();
	ОбновитьНадписиПриход();
	//Если ЗначениеЗаполнено(Объект.Отправитель.Валюта) И ЗначениеЗаполнено(Объект.Получатель.Валюта) Тогда
	//	Элементы.ГруппаСуммаОприходования.Доступность = Объект.Отправитель.Валюта <> Объект.Получатель.Валюта;
	//Иначе
	//	Элементы.ГруппаСуммаОприходования.Доступность = Истина;
	//КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьДокумента");
КонецПроцедуры

// РАСХОД //

&НаСервере
Процедура ОбновитьНадписиРасход ()
	ВалютаРасход    = Объект.Отправитель.Валюта;
	Если Не ЗначениеЗаполнено(ВалютаРасход) Тогда
		ВалютаРасход = Константы.ОсновнаяВалюта.Получить();
	КонецЕсли;	
КонецПроцедуры	

// ПРИХОД //

&НаСервере
Процедура ОбновитьНадписиПриход ()
	ВалютаПриход    = Объект.Получатель.Валюта;
	Если Не ЗначениеЗаполнено(ВалютаПриход) Тогда
		ВалютаПриход = Константы.ОсновнаяВалюта.Получить();
	КонецЕсли;	
КонецПроцедуры	


