
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПарольИзменен И Пароль <> Подтверждение Тогда
		Отказ = Истина;
		Сообщить("Пароль и подтверждение не совпадают!");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПарольИзменен Тогда
		ТекущийОбъект.ХэшПароля = ОбщийМодульСервер.ХэшироватьСтроку(Пароль);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПароль(Команда)
	ПарольИзменен = Истина;	
	Элементы.ГруппаПароль.Видимость        = Истина;
	Элементы.ГруппаПодтверждение.Видимость = Истина;
	Элементы.ИзменитьПароль.Видимость      = Ложь;
КонецПроцедуры
