
&НаКлиенте
Процедура КомандаОбновить(Команда)
	КомандаОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьНаСервере()
	МоиДолги.Очистить();
	МнеДолжны.Очистить();
	ТЗ = РегистрыНакопления.Долги.Остатки();
	Для Каждого СтрокаТЧ Из ТЗ Цикл
		Если СтрокаТЧ.Сумма > 0 Тогда
			НоваяСтрока = МоиДолги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
		Иначе	
			НоваяСтрока = МнеДолжны.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
			НоваяСтрока.Сумма = - НоваяСтрока.Сумма;
		КонецЕсли;
	КонецЦикла;	
	
    ТЗ.Свернуть("Валюта","Сумма");
	ТЗ.Сортировать("Валюта");
	Итого = "";
	Для Каждого СтрокаТЧ Из ТЗ Цикл
		Если СтрокаТЧ.Сумма <> 0 Тогда
			Итого = Итого + ?(ПустаяСтрока(Итого),"","; ") + Формат(СтрокаТЧ.Сумма,"ЧДЦ=; ЧГ=") + " " + ?(ЗначениеЗаполнено(СтрокаТЧ.Валюта),СтрокаТЧ.Валюта,"<>");
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КомандаОбновитьНаСервере();
КонецПроцедуры
