&НаКлиенте
Процедура КомандаПочта(Команда)
	ОтправитьПочту("Отзыв");
КонецПроцедуры

&НаКлиенте
Процедура КомандаПредложение(Команда)
	ОтправитьПочту("Предложение");
КонецПроцедуры

&НаКлиенте
Процедура КомандаОшибка(Команда)
	ОтправитьПочту("Ошибка");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПочту (ТипСообщения) 
	ЗапуститьПриложение("mailto:evgeniy.v.bystrov@gmail.com?subject=Мобильное приложение ""Личные деньги""" + " " + ТипСообщения);
КонецПроцедуры 	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Элементы.Справка.Документ = "Мобильное приложение создано для того, чтобы вести учет личных доходов и расходов.
	//|
	//|В следующих версиях планируется расширение функциональности планирования и отчетности, а также интеграция с типовыми решениями 1С, перевод интерфейса на английский язык.
	//|
	//|Перед началом работы перейдите на вкладку ""Справочники"" и заполните справочник ""Валюты"", ""Статьи"", ""Кошельки"".
	//|
	//|В справочнике ""Валюты"" требуется заполнить полное наименование и наименование копеек для красивого отображения в документах.
	//|
	//|
	//|На главной странице расположены кнопки быстрого доступа к созданию документов:
	//|
	//|- Приход денег - увеличивает баланс в выбранном кошельке.
	//|
	//|- Расход денег - уменьшает баланс.
	//|
	//|- Перемещение денег - перемещает денежные средства из одного кошелька в другой (например, снятие с карточки, конвертация валюты и т.д.) ";
	//
КонецПроцедуры


