
&НаКлиенте
Процедура ОткрытьСправочникСтатьиДДС(Команда)
	ОткрытьФорму("Справочник.СтатьиДДС.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникВалюты(Команда)
	ОткрытьФорму("Справочник.Валюты.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникКошельки(Команда)
	ОткрытьФорму("Справочник.Кошельки.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникКонтрагенты(Команда)
	ОткрытьФорму("Справочник.Контрагенты.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСтатьиПлана(Команда)
	ОткрытьФорму("Справочник.СтатьиПлана.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникПользователи(Команда)
	ОткрытьФорму("Справочник.Пользователи.ФормаСписка");
КонецПроцедуры
