&НаСервере
Процедура ОбновитьОстаткиДС()
	ОстаткиДС.Очистить();
	ТЗ    = РегистрыНакопления.ДенежныеСредства.Остатки();
	ТЗ.Сортировать("Кошелек");
	Колонка = ТЗ.Колонки.Добавить("Валюта");
	Итого = 0;
	Для Каждого СтрокаТЧ Из ТЗ Цикл
		НоваяСтрока = ОстаткиДС.Добавить();
		СтрокаТЧ.Валюта = СтрокаТЧ.Кошелек.Валюта;
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
	КонецЦикла;	
	
	ТЗ.Свернуть("Валюта","Сумма");
	ТЗ.Сортировать("Валюта");
	Итого = "";
	Для Каждого СтрокаТЧ Из ТЗ Цикл
		Если СтрокаТЧ.Сумма <> 0 Тогда
			Итого = Итого + ?(ПустаяСтрока(Итого),"","; ") + Формат(СтрокаТЧ.Сумма,"ЧДЦ=; ЧГ=") + " " + ?(ЗначениеЗаполнено(СтрокаТЧ.Валюта),СтрокаТЧ.Валюта,"<>");
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаОбновитьОстаткиДС(Команда)
	ОбновитьОстаткиДС();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьОстаткиДС();
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.Остатки.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ОткрытьФорму("Обработка.ЖурналТранзакций.Форма.Форма",Новый Структура("Кошелек",ТекСтрока.Кошелек));
	КонецЕсли;	
КонецПроцедуры
