Процедура ПервоначальноеЗаполнение() Экспорт
	Выборка = Справочники.СтатьиДДС.Выбрать();
	Если Не Выборка.Следующий() Тогда
		Наименования = Новый Массив;
		Наименования.Добавить(НСтр("ru = 'Прочие расходы'; en = 'Other'"));
		Наименования.Добавить(НСтр("ru = 'Корректировка сальдо'; en = 'Balance correction'"));
		
		Для Каждого Наименование Из Наименования Цикл
			Если Не ЗначениеЗаполнено(Справочники.СтатьиДДС.НайтиПоНаименованию(Наименование)) Тогда
				Эл = Справочники.СтатьиДДС.СоздатьЭлемент();
				Эл.Наименование                = Наименование;
				Эл.ОтображатьВОтчетеПоРасходам = Истина;
				Эл.СтатьяПлана                 = Справочники.СтатьиПлана.Прочее;
				Эл.Записать();
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
