
&НаКлиенте
Процедура ОткрытьЖурнал(Команда)
	ОткрытьФорму("ЖурналДокументов.ЖурналДокументовДС.ФормаСписка");
КонецПроцедуры

// ПРИХОДЫ //

&НаКлиенте
Процедура КомандаПриходыДенег(Команда)
	ОткрытьФорму("Документ.ПриходДенег.ФормаСписка");
КонецПроцедуры
&НаКлиенте
Процедура НовыйПриходДенег(Команда)
	ОткрытьФорму("Документ.ПриходДенег.ФормаОбъекта");
КонецПроцедуры

// РАСХОДЫ //

&НаКлиенте
Процедура КомандаРасходыДенег(Команда)
	ОткрытьФорму("Документ.РасходДенег.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НовыйРасходДенег(Команда)
	ОткрытьФорму("Документ.РасходДенег.ФормаОбъекта");
КонецПроцедуры

// ПЕРЕМЕЩЕНИЯ //

&НаКлиенте
Процедура КомандаПеремещенияДенег(Команда)
	ОткрытьФорму("Документ.ПеремещениеДенег.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НовоеПеремещениеДенег(Команда)
	ОткрытьФорму("Документ.ПеремещениеДенег.ФормаОбъекта");
КонецПроцедуры

// ДОЛГИ //

&НаКлиенте
Процедура КомандаДолги(Команда)
	ОткрытьФорму("Документ.Долг.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НовыйДолг(Команда)
	ОткрытьФорму("Документ.Долг.ФормаОбъекта");
КонецПроцедуры

