
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Долги.Очистить();
	Движения.Долги.Записывать = Истина;
	Движение             = Движения.Долги.Добавить();
	Если ВидОперации = Перечисления.ВидОперацииДолг.ЯВзялВДолг Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сумма       = Сумма;
	ИначеЕсли ВидОперации = Перечисления.ВидОперацииДолг.ЯВернулДолг Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сумма       = Сумма;
	ИначеЕсли ВидОперации = Перечисления.ВидОперацииДолг.УМеняВзялиВДолг Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сумма       = -Сумма;
	ИначеЕсли ВидОперации = Перечисления.ВидОперацииДолг.МнеВернулиДолг Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сумма       = -Сумма;
	КонецЕсли;
	Движение.Период      = Дата;
	Движение.Контрагент  = Контрагент;
	Движение.Валюта      = Валюта;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюта = Константы.ОсновнаяВалюта.Получить();
	КонецЕсли;	
КонецПроцедуры
