
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДенежныеСредства.Записывать = Истина;
	Движения.ДвижениеДенежныхСредств.Записывать = Истина;
	Движения.Долги.Записывать = Истина;
	
	Для Каждого СтрокаТЧ Из Суммы Цикл
		// регистр ДенежныеСредства Приход
		Движение             = Движения.ДенежныеСредства.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = Дата;
		Движение.Кошелек     = Кошелек;
		Движение.Сумма       = СтрокаТЧ.Сумма;
		Движение.СтатьяДДС   = СтрокаТЧ.СтатьяДДС;
		
		// регистр ДвижениеДенежныхСредств Приход
		Движение             = Движения.ДвижениеДенежныхСредств.Добавить();
		Движение.Период      = Дата;
		Движение.Кошелек     = Кошелек;
		Движение.СтатьяДДС   = СтрокаТЧ.СтатьяДДС;
		Движение.СуммаПриход = СтрокаТЧ.Сумма * Курс / Кратность;
		Движение.Расшифровка = Расшифровка;
		
		Если Долг Тогда
			Движение = Движения.Долги.ДобавитьПриход();
			Движение.Период     = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Валюта     = Кошелек.Валюта;
			Движение.Сумма      = СтрокаТЧ.Сумма;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ОсновнаяВалюта = Константы.ОсновнаяВалюта.Получить();
	ВалютаКошелька = Кошелек.Валюта;
	
	Если Курс = 0 Или ВалютаКошелька = ОсновнаяВалюта Или НЕ ЗначениеЗаполнено(ВалютаКошелька) Тогда
		Курс = 1;
	КонецЕсли;
	
	Если Кратность = 0 Или ВалютаКошелька = ОсновнаяВалюта Или НЕ ЗначениеЗаполнено(ВалютаКошелька) Тогда
		Кратность = 1;
	КонецЕсли;	
	
	СуммаДокумента = Суммы.Итог("Сумма");
	
	ПредставлениеСтатьи = "";
	Для Каждого СтрокаТЧ Из Суммы Цикл
		ПредставлениеСтатьи = ПредставлениеСтатьи + ?(ПустаяСтрока(ПредставлениеСтатьи),"",", ") + СтрокаТЧ.СтатьяДДС;
	КонецЦикла;	
КонецПроцедуры
