Функция ПолучитьНастройку (ИмяНастройки) Экспорт
	Запись = РегистрыСведений.ХранилищеНастроек.СоздатьМенеджерЗаписи();
	Запись.ИмяНастройки = ВРег(ИмяНастройки);
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.Настройка.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции

Функция СохранитьНастройку (ИмяНастройки,СодержаниеНастройки) Экспорт
	Запись = РегистрыСведений.ХранилищеНастроек.СоздатьМенеджерЗаписи();
	Запись.ИмяНастройки = ВРег(ИмяНастройки);
	Запись.Настройка = Новый ХранилищеЗначения(СодержаниеНастройки);
	Попытка
		Запись.Записать(Истина);
		Возврат Истина;
	Исключение
		Возврат ЛОЖЬ;
	КонецПопытки;	
КонецФункции	