
&НаКлиенте
Процедура ОткрытьОтчетРасходыДиаграмма(Команда)
	ОткрытьФорму("Обработка.ДиаграммаДоходовРасходов.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетРасходы(Команда)
	ОткрытьФорму("Обработка.РасходыЗаПериод.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетДолги(Команда)
	ОткрытьФорму("Обработка.Долги.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПланФакт(Команда)
	ОткрытьФорму("Обработка.ПланФактныйАнализРасходов.Форма.Форма");
КонецПроцедуры
