
&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	Объект.НачалоПериода = ПолучитьНачалоПериода(Объект.НачалоПериода,Объект.Периодичность); 
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	Объект.КонецПериода = ПолучитьКонецПериода(Объект.КонецПериода,Объект.Периодичность);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНачалоПериода(Дата,Периодичность)
	Если Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат НачалоКвартала(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат НачалоМесяца(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат НачалоНедели(Дата);
	Иначе
		Возврат НачалоДня(Дата);
	КонецЕсли;	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьКонецПериода(Дата,Периодичность)
	Если Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат КонецКвартала(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат КонецМесяца(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат КонецНедели(Дата);
	Иначе
		Возврат КонецДня(Дата);
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	Объект.НачалоПериода = ПолучитьНачалоПериода(Объект.НачалоПериода,Объект.Периодичность); 
	Объект.КонецПериода  = ПолучитьКонецПериода(Объект.КонецПериода,Объект.Периодичность);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаФормСервер.НастройкаПриСозданииФормы(ЭтаФорма,Объект,"План");
КонецПроцедуры

// УПРАВЛЕНИЕ ФОРМОЙ //

// КЛИЕНТСКИЕ ПРОЦЕДУРЫ //

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	НоваяСтрока     = Объект.План.Добавить();
	НоваяСтрока.УИД = СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","_");
	СоздатьОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	УИД = СтрЗаменить(Команда.Имя,"Удалить_","");
	УдалитьЭлементыСтроки(УИД);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизита (Элемент)
	НастройкаФормКлиент.ПриИзмененииРеквизита(ЭтаФорма,Объект,"План",Элемент);
КонецПроцедуры	

// СЕРВЕРНЫЕ ПРОЦЕДУРЫ //

&НаСервере
Процедура СоздатьОбновитьЭлементыФормы ()
	НастройкаФормСервер.СоздатьОбновитьЭлементыФормы(ЭтаФорма,Объект,"План");
КонецПроцедуры	

&НаСервере
Процедура УдалитьЭлементыСтроки (УИД)
	НастройкаФормСервер.УдалитьЭлементыСтроки(ЭтаФорма,Объект,"План",УИД);
КонецПроцедуры	
