
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пользователь = Константы.ПоследнийАвторизованныйПользователь.Получить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	Если ПроверитьПароль() Тогда
		МожноЗакрывать = Истина;
		Закрыть();
	Иначе
		Сообщить("Неверный пароль!");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьПароль () 
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Константы.ПоследнийАвторизованныйПользователь.Установить(Пользователь);
	
	Возврат Пользователь.ХэшПароля = ОбщийМодульСервер.ХэшироватьСтроку(Пароль);
КонецФункции	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Не МожноЗакрывать Тогда 
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры
