
&НаКлиенте
Процедура КомандаОбновить(Команда)
	КомандаОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьНаСервере()
	ТаблицаПланФакт.Очистить();
	Отбор = Новый Структура;
	Если ЗначениеЗаполнено(Периодичность) Тогда
		Отбор.Вставить("Периодичность",Периодичность);
	КонецЕсли;	
	ТЗПлан = РегистрыНакопления.ПланДвиженияДС.Обороты(Период.ДатаНачала,Период.ДатаОкончания,Отбор,"СтатьяПлана","СуммаРасход");
	ТЗПлан.Сортировать("СуммаРасход УБЫВ");
	Для Каждого СтрокаТЧ Из ТЗПлан Цикл 
		НоваяСтрока = ТаблицаПланФакт.Добавить();
		НоваяСтрока.СтатьяПлана  = СтрокаТЧ.СтатьяПлана;
		НоваяСтрока.ПланРасход = СтрокаТЧ.СуммаРасход; 
	КонецЦикла;	
	
	ТЗФакт = РегистрыНакопления.ДвижениеДенежныхСредств.Обороты(Период.ДатаНачала,Период.ДатаОкончания,,"СтатьяДДС","СуммаРасход");
	Для Каждого СтрокаТЧ Из ТЗФакт Цикл 
		Если НЕ СтрокаТЧ.СтатьяДДС.ОтображатьВОтчетеПоРасходам Тогда
			Продолжить;
		КонецЕсли;	
		ИскомыеСтроки = ТаблицаПланФакт.НайтиСтроки(Новый Структура("СтатьяПлана",СтрокаТЧ.СтатьяДДС.СтатьяПлана));
		Если ИскомыеСтроки.Количество() > 0 Тогда
			ИскомыеСтроки[0].ФактРасход = ИскомыеСтроки[0].ФактРасход + СтрокаТЧ.СуммаРасход;
		Иначе
			НоваяСтрока = ТаблицаПланФакт.Добавить();
			НоваяСтрока.СтатьяПлана = СтрокаТЧ.СтатьяДДС.СтатьяПлана;
			НоваяСтрока.ФактРасход  = СтрокаТЧ.СуммаРасход; 
		КонецЕсли;	
	КонецЦикла;	
	
	// ОБНОВИМ ДИАГРАММУ //
	Диаграмма.Очистить();
	Серия = Диаграмма.Серии.Добавить("План");
	Серия.Цвет = Новый Цвет(,255,0);
	
	Серия = Диаграмма.Серии.Добавить("Факт");
	Серия.Цвет = Новый Цвет(255,255,0);
	
	Для Каждого СтрокаТЧ Из ТаблицаПланФакт Цикл
		Точка = Диаграмма.Точки.Добавить(СтрокаТЧ.СтатьяПлана.Наименование);
		Диаграмма.УстановитьЗначение(Точка,0,СтрокаТЧ.ПланРасход);
		Диаграмма.УстановитьЗначение(Точка,1,СтрокаТЧ.ФактРасход);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	КомандаОбновитьНаСервере();
КонецПроцедуры
