
&НаКлиенте
Процедура ЖурналТранзакцийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.ЖурналТранзакций.ТекущиеДанные.Регистратор);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	КомандаОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьНаСервере()
	ЖурналТранзакций.Очистить();
	Выборка = РегистрыНакопления.ДенежныеСредства.Выбрать(Период.ДатаНачала,Период.ДатаОкончания,Новый Структура("Кошелек",Параметры.Кошелек));
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЖурналТранзакций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		НоваяСтрока.Сумма    = ?(Выборка.ВидДвижения = ВидДвиженияНакопления.Приход,1,-1) * НоваяСтрока.Сумма;
		НоваяСтрока.Операция = Выборка.Регистратор.Метаданные().Синоним;
	КонецЦикла;	
	
	НачальныйОстаток = 0;
	КонечныйОстаток  = 0;
	
	ДанныеОбОстатках = РегистрыНакопления.ДенежныеСредства.Остатки(Новый Граница(Период.ДатаНачала,ВидГраницы.Исключая),Новый Структура("Кошелек",Параметры.Кошелек));
	Для Каждого СтрокаТЧ ИЗ ДанныеОбОстатках Цикл
		НачальныйОстаток = СтрокаТЧ.Сумма;
	КонецЦикла;	
	
	ДанныеОбОстатках = РегистрыНакопления.ДенежныеСредства.Остатки(Новый Граница(Период.ДатаОкончания,ВидГраницы.Включая),Новый Структура("Кошелек",Параметры.Кошелек));
	Для Каждого СтрокаТЧ ИЗ ДанныеОбОстатках Цикл
		КонечныйОстаток = СтрокаТЧ.Сумма;
	КонецЦикла;	       	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	КомандаОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.Вариант = ВариантСтандартногоПериода.Последние7Дней;
	КомандаОбновитьНаСервере();
КонецПроцедуры
