
&НаКлиенте
Процедура ТестСинхронизации(Команда)
	ТестОбменаДанными();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСинхронизацию(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ТестОбменаДанными ()
	Набор = РеквизитФормыВЗначение("НаборКонстант");
	Набор.Записать();
	
	ТекстОшибки  = "";
	Пользователь = "";
	Пароль       = "";
    
	Адрес = Константы.АдресСервисаОбменаДанными.Получить();
  	Адрес = Адрес + "/ws/moneyexchange.1cws?wsdl";
    
	//Адрес = "http://localhost/PesonalMoney/ws/moneyexchange.1cws?wsdl"; 
	Попытка
        Определения = Новый WSОпределения(Адрес,Пользователь,Пароль, 60);
		URI = "http://www.play.google.com/evgeniy.v.bystrov.money/exchange";
		Прокси = Новый WSПрокси(Определения, URI, "PersonalMoneyExchange", "PersonalMoneyExchangeSoap");
		Прокси.Пользователь = Пользователь;
		Прокси.Пароль       = Пароль;
		Рез = Прокси.ПолучитьСвободныйНомерУзла();
		Сообщить(НСтр("ru = 'Подключено успешно!'; en = 'Success!'"));
    Исключение
 		Сообщить(НСтр("ru = 'Подключиться не удалось!'; en = 'Connection failed!'"));
	КонецПопытки;
КонецПроцедуры	
