Процедура ПервоначальноеЗаполнение() Экспорт
	СоответствиеКодов = Новый Соответствие;
	СоответствиеКодов.Вставить("978","EUR");
	СоответствиеКодов.Вставить("840","USD");
	СоответствиеКодов.Вставить("643","RUR");
	
	Для Каждого Эл Из СоответствиеКодов Цикл
		Если Не ЗначениеЗаполнено(Справочники.Валюты.НайтиПоКоду(Эл.Ключ)) Тогда
			Спр = Справочники.Валюты.СоздатьЭлемент();
			Спр.Код          = Эл.Ключ;
			Спр.Наименование = Эл.Значение;
			Спр.Записать();
		КонецЕсли;	
	КонецЦикла;	
	
	Если Не ЗначениеЗаполнено(Константы.ОсновнаяВалюта.Получить()) Тогда
		Если НСтр("ru = 'Валюта'; en = 'Currency'") = "Валюта" Тогда
			Константы.ОсновнаяВалюта.Установить(Справочники.Валюты.НайтиПоКоду("643"));
		Иначе
			Константы.ОсновнаяВалюта.Установить(Справочники.Валюты.НайтиПоКоду("840"));
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
