// КЛИЕНТСКИЕ ПРОЦЕДУРЫ И ФУНКЦИИ //

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьДокумента");
КонецПроцедуры

&НаКлиенте
Процедура КошелекПриИзменении(Элемент)
	ПриИзмененииКошелька();
КонецПроцедуры

&НаКлиенте
Процедура ДолгПриИзменении(Элемент)
	ОбновитьПредставления();
	Если Не Объект.Долг Тогда
		Объект.Контрагент = Неопределено;
	КонецЕсли;	
КонецПроцедуры

// СЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ //

&НаСервере
Процедура ПриИзмененииКошелька ()
	ВалютаКошелька = Объект.Кошелек.Валюта;
	ОбновитьПредставления();
КонецПроцедуры	

&НаСервере
Процедура ОбновитьПредставления ()
	Если ОсновнаяВалюта <> Объект.Кошелек.Валюта Тогда
		Элементы.ГруппаКурсКратность.Видимость = Истина;
		КурсКратность = ОбщийМодульСервер.ПолучитьКурсКратностьВалюты(Объект.Кошелек.Валюта, Объект.Дата); 
		ЗаполнитьЗначенияСвойств(Объект,КурсКратность);
	Иначе
		Курс      = 1;
		Кратность = 1;
		Элементы.ГруппаКурсКратность.Видимость = Ложь;
	КонецЕсли;	                                       	
	Элементы.Контрагент.Доступность = Объект.Долг;
КонецПроцедуры	

// ИНИЦИАЛИЗАЦИЯ ДОКУМЕНТА //

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РЕЗ = ОбщийМодульСервер.ПолучитьЗначенияПоУмолчанию(РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя(),"Кошелек,СтатьяДДС");
		ЗаполнитьЗначенияСвойств(Объект,Рез);
		НоваяСтрока = Объект.Суммы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Рез);	
	КонецЕсли; 
	ОсновнаяВалюта = Константы.ОсновнаяВалюта.Получить();
	ВалютаКошелька = Объект.Кошелек.Валюта;
	ОбновитьПредставления();
	
	НастройкаФормСервер.НастройкаПриСозданииФормы(ЭтаФорма,Объект,"Суммы");
КонецПроцедуры

// УПРАВЛЕНИЕ ФОРМОЙ //

// КЛИЕНТСКИЕ ПРОЦЕДУРЫ //

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	НоваяСтрока     = Объект.Суммы.Добавить();
	НоваяСтрока.УИД = СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","_");
	СоздатьОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	УИД = СтрЗаменить(Команда.Имя,"Удалить_","");
	УдалитьЭлементыСтроки(УИД);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизита (Элемент)
	НастройкаФормКлиент.ПриИзмененииРеквизита(ЭтаФорма,Объект,"Суммы",Элемент);
КонецПроцедуры	

// СЕРВЕРНЫЕ ПРОЦЕДУРЫ //

&НаСервере
Процедура СоздатьОбновитьЭлементыФормы ()
	НастройкаФормСервер.СоздатьОбновитьЭлементыФормы(ЭтаФорма,Объект,"Суммы");
КонецПроцедуры	

&НаСервере
Процедура УдалитьЭлементыСтроки (УИД)
	НастройкаФормСервер.УдалитьЭлементыСтроки(ЭтаФорма,Объект,"Суммы",УИД);
КонецПроцедуры	
